_posts/2014-02-10-Merging-bibtex-files-and-avoiding-duplicates.html
---
title: Merging bibtex files and avoiding duplicates
date: 2014/02/10 07:42:49
updated: 2014/02/10 07:42:49
categories: bibtex
tags: 
---


<p>
I usually advocate to have a master bibtex file with all entries in it. Emacs is helpful at avoiding duplicate entries as you enter them. Sometimes though, you have more than one bibtex file. Maybe you started one for a new project, or someone sent you one. In any case, you want to merge the files into one file. Bibtex requires each entry to have a unique key. 
</p>

<p>
Let us begin. I have two bibtex files I exported from Endnote. I have
already removed all the non-ascii characters and cleaned them up
pretty well. We start with some analysis. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> bibtexparser.bparser <span style="color: #8b0000;">import</span> BibTexParser
<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'../../CMU/proposals/link-to-2014/bo2-polymorphs/bo2-polymorphs.bib'</span>, <span style="color: #228b22;">'r'</span>) <span style="color: #8b0000;">as</span> bibfile:
    <span style="color: #8b008b;">bp</span> = BibTexParser(bibfile)
    <span style="color: #8b008b;">entries1</span> = bp.get_entry_list()

<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0} entries in file 1'</span>.<span style="color: #cd0000;">format</span>(<span style="color: #cd0000;">len</span>(entries1))

<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'../../CMU/proposals/link-to-2014/perovskite-strain/perovskite-strain.bib'</span>, <span style="color: #228b22;">'r'</span>) <span style="color: #8b0000;">as</span> bibfile:
    <span style="color: #8b008b;">bp</span> = BibTexParser(bibfile)
    <span style="color: #8b008b;">entries2</span> = bp.get_entry_list()

<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0} entries in file 2'</span>.<span style="color: #cd0000;">format</span>(<span style="color: #cd0000;">len</span>(entries2))
</pre>
</div>

<pre class="example">
100 entries in file 1
129 entries in file 2
</pre>

<p>
Now, let see how many duplicates there are. It is easy to use sets for this.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">store keys to check for duplicates</span>
<span style="color: #8b0000;">from</span> bibtexparser.bparser <span style="color: #8b0000;">import</span> BibTexParser
<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'../../CMU/proposals/link-to-2014/bo2-polymorphs/bo2-polymorphs.bib'</span>, <span style="color: #228b22;">'r'</span>) <span style="color: #8b0000;">as</span> bibfile:
    <span style="color: #8b008b;">bp</span> = BibTexParser(bibfile)
    <span style="color: #8b008b;">entries1</span> = bp.get_entry_list()

<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'../../CMU/proposals/link-to-2014/perovskite-strain/perovskite-strain.bib'</span>, <span style="color: #228b22;">'r'</span>) <span style="color: #8b0000;">as</span> bibfile:
    <span style="color: #8b008b;">bp</span> = BibTexParser(bibfile)
    <span style="color: #8b008b;">entries2</span> = bp.get_entry_list()

<span style="color: #8b008b;">entry1_keys</span> = <span style="color: #cd0000;">set</span>([entry[<span style="color: #228b22;">'id'</span>] <span style="color: #8b0000;">for</span> entry <span style="color: #8b0000;">in</span> entries1])
<span style="color: #8b008b;">entry2_keys</span> = <span style="color: #cd0000;">set</span>([entry[<span style="color: #228b22;">'id'</span>] <span style="color: #8b0000;">for</span> entry <span style="color: #8b0000;">in</span> entries2])

<span style="color: #8b008b;">duplicates</span> = entry1_keys &amp; entry2_keys
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'There are {0} duplicates'</span>.<span style="color: #cd0000;">format</span>(<span style="color: #cd0000;">len</span>(duplicates))
<span style="color: #8b0000;">print</span> duplicates
</pre>
</div>

<pre class="example">
There are 20 duplicates
set(['nolan-2008-vacan-co', 'giocondi-2001-spatial', 'giocondi-2001-spatial-batio3', 'wang-2006-oxidat-gga', 'piskunov-2008-elect-lamno3', 'pala-2007-modif-oxidat', 'chretien-2006-densit-funct', 'giocondi-2008-sr2nb-batio3', 'kushima-2010-compet-lacoo3', 'pala-2009-co-ti', 'giocondi-2007-srtio3', 'lee-2009-ab-labo3', 'balasubramanian-2005-epitax-phase', 'mastrikov-2010-pathw-oxygen', 'shapovalov-2007-catal', 'evarestov-2005-compar-lcao', 'choi-2007-comput-study', 'havelia-2009-nucleat-growt', 'lee-2009-ab-defec', 'lee-2009-predic-surfac'])
</pre>

<p>
Ok, now we make a function to format each entry. We take that code from this <a href="http://kitchingroup.cheme.cmu.edu/blog/2014/02/09/Sorting-fields-in-bibtex-entries/">this post</a> and turn it into a function. Then we add all the entries from the first file. Then, we add entries from the second file as long as the key is not in the list from the first file.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> bibtexparser.bparser <span style="color: #8b0000;">import</span> BibTexParser
<span style="color: #8b0000;">import</span> os, textwrap

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">format_bibtex_entry</span>(entry):
    <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">field, format, wrap or not</span>
    <span style="color: #8b008b;">field_order</span> = [(u<span style="color: #228b22;">'author'</span>, <span style="color: #228b22;">'{{{0}}},\n'</span>, <span style="color: #cd0000;">True</span>),
                   (u<span style="color: #228b22;">'title'</span>, <span style="color: #228b22;">'{{{0}}},\n'</span>, <span style="color: #cd0000;">True</span>),
                   (u<span style="color: #228b22;">'journal'</span>,<span style="color: #228b22;">'"{0}",\n'</span>, <span style="color: #cd0000;">True</span>),
                   (u<span style="color: #228b22;">'volume'</span>,<span style="color: #228b22;">'{{{0}}},\n'</span>, <span style="color: #cd0000;">True</span>),
                   (u<span style="color: #228b22;">'number'</span>, <span style="color: #228b22;">'{{{0}}},\n'</span>, <span style="color: #cd0000;">True</span>),
                   (u<span style="color: #228b22;">'pages'</span>, <span style="color: #228b22;">'{{{0}}},\n'</span>, <span style="color: #cd0000;">True</span>),
                   (u<span style="color: #228b22;">'year'</span>, <span style="color: #228b22;">'{0},\n'</span>, <span style="color: #cd0000;">True</span>),
                   (u<span style="color: #228b22;">'doi'</span>,<span style="color: #228b22;">'{{{0}}},\n'</span>, <span style="color: #cd0000;">False</span>),
                   (u<span style="color: #228b22;">'url'</span>,<span style="color: #228b22;">'{{\url{{{0}}}}},\n'</span>, <span style="color: #cd0000;">False</span>),
                   (u<span style="color: #228b22;">'link'</span>,<span style="color: #228b22;">'{{\url{{{0}}}}},\n'</span>, <span style="color: #cd0000;">False</span>)]
    
    <span style="color: #8b008b;">keys</span> = <span style="color: #cd0000;">set</span>(entry.keys())

    <span style="color: #8b008b;">extra_fields</span> = keys.difference([f[0] <span style="color: #8b0000;">for</span> f <span style="color: #8b0000;">in</span> field_order])
    <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">we do not want these in our entry</span>
    extra_fields.remove(<span style="color: #228b22;">'type'</span>)
    extra_fields.remove(<span style="color: #228b22;">'id'</span>)

    <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Now build up our entry string</span>
    <span style="color: #8b008b;">s</span> = <span style="color: #228b22;">'@{type}{{{id},\n'</span>.<span style="color: #cd0000;">format</span>(<span style="color: #cd0000;">type</span>=entry[<span style="color: #228b22;">'type'</span>].upper(),
                                  <span style="color: #cd0000;">id</span>=entry[<span style="color: #228b22;">'id'</span>])

    <span style="color: #8b0000;">for</span> field, fmt, wrap <span style="color: #8b0000;">in</span> field_order:
        <span style="color: #8b0000;">if</span> field <span style="color: #8b0000;">in</span> entry:
            <span style="color: #8b008b;">s1</span> = <span style="color: #228b22;">'  {0} ='</span>.<span style="color: #cd0000;">format</span>(field.upper())
            <span style="color: #8b008b;">s2</span> = fmt.<span style="color: #cd0000;">format</span>(entry[field])
            <span style="color: #8b008b;">s3</span> = <span style="color: #228b22;">'{0:17s}{1}'</span>.<span style="color: #cd0000;">format</span>(s1, s2)
            <span style="color: #8b0000;">if</span> wrap:
                <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">fill seems to remove trailing '\n'</span>
                <span style="color: #8b008b;">s3</span> = textwrap.fill(s3, subsequent_indent=<span style="color: #228b22;">' '</span>*18, width=70) + <span style="color: #228b22;">'\n'</span>
            <span style="color: #8b008b;">s</span> += s3  

    <span style="color: #8b0000;">for</span> field <span style="color: #8b0000;">in</span> extra_fields:
        <span style="color: #8b0000;">if</span> field <span style="color: #8b0000;">in</span> entry:
            <span style="color: #8b008b;">s1</span> = <span style="color: #228b22;">'  {0} ='</span>.<span style="color: #cd0000;">format</span>(field.upper())
            <span style="color: #8b008b;">s2</span> = entry[field]
            <span style="color: #8b008b;">s3</span> = <span style="color: #228b22;">'{0:17s}{{{1}}}'</span>.<span style="color: #cd0000;">format</span>(s1, s2)
            <span style="color: #8b008b;">s3</span> = textwrap.fill(s3, subsequent_indent=<span style="color: #228b22;">' '</span>*18, width=70) + <span style="color: #228b22;">'\n'</span>
            <span style="color: #8b008b;">s</span> += s3  

    <span style="color: #8b008b;">s</span> += <span style="color: #228b22;">'}\n\n'</span>
    <span style="color: #8b0000;">return</span> s

<span style="color: #8b0000;">if</span> os.path.exists(<span style="color: #228b22;">'merged.bib'</span>): os.unlink(<span style="color: #228b22;">'merged.bib'</span>)    

<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'../../CMU/proposals/link-to-2014/bo2-polymorphs/bo2-polymorphs.bib'</span>, <span style="color: #228b22;">'r'</span>) <span style="color: #8b0000;">as</span> bibfile:
    <span style="color: #8b008b;">bp</span> = BibTexParser(bibfile)
    <span style="color: #8b008b;">entries1</span> = bp.get_entry_list()

<span style="color: #8b0000;">for</span> entry <span style="color: #8b0000;">in</span> entries1:
    <span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'merged.bib'</span>, <span style="color: #228b22;">'a'</span>) <span style="color: #8b0000;">as</span> f:
        f.write(format_bibtex_entry(entry))

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">store keys to check for duplicates</span>
<span style="color: #8b008b;">entry1_keys</span> = [entry[<span style="color: #228b22;">'id'</span>] <span style="color: #8b0000;">for</span> entry <span style="color: #8b0000;">in</span> entries1]

<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'../../CMU/proposals/link-to-2014/perovskite-strain/perovskite-strain.bib'</span>, <span style="color: #228b22;">'r'</span>) <span style="color: #8b0000;">as</span> bibfile:
    <span style="color: #8b008b;">bp</span> = BibTexParser(bibfile)
    <span style="color: #8b008b;">entries2</span> = bp.get_entry_list()

<span style="color: #8b0000;">for</span> entry <span style="color: #8b0000;">in</span> entries2:
    <span style="color: #8b0000;">if</span> <span style="color: #8b0000;">not</span> entry[<span style="color: #228b22;">'id'</span>] <span style="color: #8b0000;">in</span> entry1_keys:
        <span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'merged.bib'</span>, <span style="color: #228b22;">'a'</span>) <span style="color: #8b0000;">as</span> f:
            f.write(format_bibtex_entry(entry))
</pre>
</div>

<p>
Here is the merged file: <a href="/media/2014-02-10-Merging-bibtex-files-and-avoiding-duplicates/merged.bib">merged.bib</a> and the corresponding bibliography <a href="/media/2014-02-10-Merging-bibtex-files-and-avoiding-duplicates/merged.pdf">merged.pdf</a> . There are 209 entries in it, which is what we expected given that there were 20 duplicates. There are no doubt other programs that merge bibtex files, but I like this approach for the following reasons:
</p>
<ol class="org-ol">
<li>I learned a new python module that parses bibtex files.
</li>
<li>I got my entries formatted exactly the way I wanted them.
</li>
<li>I defined what constituted a duplicate.
</li>
</ol>

<p>
Of course, here we only eliminate entries with duplicate keys. If the same entry has different keys, they will be merged. This is a very hard problem to get right, since there are many possible ways to abbreviate author names, journal names, and multiple ways to write the title. That is a problem best solved by using a systematic way of generating the keys, so that you minimize the possibility of duplicates that way.
</p>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/02/10/Merging-bibtex-files-and-avoiding-duplicates.org">org-mode source</a><p><p>Org-mode version = 8.2.5h</p>